{
  "clear": null,
  "about": {
    "cue": "About Me",
    "options": {},
    "response": "As a passionate developer, my primary focus lies in building scalable products that cater to a wide audience over extended periods. I excel at optimizing existing code and crafting efficient solutions. If you seek someone dependable, capable of providing prompt problem-solving without hesitation, look no further—I'm your solution driver. My approach involves inquisitiveness—I ask questions, delve into topics, and comprehend deeply. This enables me to deliver solutions that thrive at scale. <br>My experience spans system design, microservices management, REST standards, and cloud infrastructure automation. Additionally, I specialize in NodeJS an Kubernetes. Beyond coding, I enjoy badminton, chess, reading, and indulging in anime. <br>Feel free to reach out if you need a reliable and proactive developer on your team!"
  },
  "skills": {
    "cue": "My skills",
    "response": "<table><tr><td>Development</td><td>NodeJS, Haskell, Python</td></tr>  <tr><td>Systems</td><td>Kubernetes, AWS tools, Victoria Metrics, Postgres, Clickhouse, Redis, Firestore</td></tr>  <tr><td>Programming</td><td>C++, JavaScript</td></tr>  <tr><td>Hobbies</td><td>Badminton, Chess</td></tr></table>"
  },
  "experience": {
    "cue": "My experience",
    "response": "<dl><dt><b>Software Developer Engineer</b> - Juspay</dt><dd>June 2022 — Current. (Banglore, on-site)</dd><ul><li>Implemented an automated predictive scaling system for applications, leveraging historical traffic data to achieve seamless and proactive scaling. The result is a remarkable scale-up capability of 3000 transactions per second (TPS), ensuring optimal performance under varying workloads.</li>         <li>Implemented an advanced dynamic rate limiter to secure applications, integrated with an intelligent scaling mechanism for the application server. This setup dynamically scales up as needed, ensuring optimal performance under varying workloads.</li>                   <li>Achieved a 40% reduction in infrastructure costs through the implementation of automated right-sizing for Pod resource requests. This enhancement includes accelerated scale-down and scale-up processes, ensuring swift adaptation to changing demands and optimizing resource utilization for increased efficiency.</li>                         <li>Enhanced visibility into operational metrics, including cost, transactions per second (TPS), and resource requirements. Implemented automated features for estimating costs during scale-ups, predicting resource needs, and dynamically utilizing both Spot and On-Demand nodes based on demand fluctuations. This optimization strategy aims to enhance efficiency and reduce infrastructure costs.</li></ul>                                                          <dt><b>Software Developer Engineer (Intern)</b> - Juspay</dt><dd>June 2021 — June 2022. (Banglore, on-site)</dd><ul><li>Integrated a business rule engine and deployed a Puppeteer-based HTML to PDF converter to streamline the mailing process of signed documents, ensuring efficiency in document handling and delivery.</li>               <li>Engineered a user-friendly Web recorder incorporating DOM Manipulation and RRWebPlayer. This innovative approach enhances the user experience by enabling dynamic interaction tracking, ensuring a seamless and intuitive recording process.</li>                            <li>Designed an intuitive onboarding flow for lenders and merchants, streamlining the process through dynamic and user-friendly clicks. This design ensures a smooth and efficient experience for users during the onboarding process.</li>                     <li>Engineered a user-friendly Web recorder incorporating DOM Manipulation and RRWebPlayer. This innovative approach enhances the user experience by enabling dynamic interaction tracking, ensuring a seamless and intuitive recording process.</li>                            <li>Implemented asymmetric encryption to guarantee robust data security during transit, fortifying the protection of sensitive information.</li></ul>                               <dt><b>Software Developer Intern </b> - Infoware</dt><dd>June 2020 — Dec 2020. Ahemdabad (Remote)</dd><ul><li>Developed a dynamic E-Commerce application supporting multiple sellers and products, featuring variable pricing based on distinct pin codes. Additionally, implemented advanced chat functionalities using Socket.IO to enhance product support, enabling users to seamlessly exchange messages, attachments, audio, and more.</li></ul></dl>"
  },
  "projects": {
    "cue": "My projects",
    "response": "<table><tr><td>Spotify playlists merger</td><td>Leveraged Spotify API to fetch and merge selected playlists, creating a consolidated playlist for the user while efficiently managing old playlists by deletion.</td></tr>  <tr><td>Crossword Puzzle</td><td>Implemented UI-based questions and answers, with user progress tracking stored on the backend using Supabase PostgreSQL (PSQL).</td></tr>  <tr><td>Bill-Splitting App</td><td>Developed an application facilitating both equal and unequal splitting of bills among friends, featuring a simplified transaction management system.</td></tr>  </table>"
  },
  "contact": {
    "cue": "How to contact me",
    "response": "<table><tr><td>Email</td><td><a href=\"mailto:shobhitmaheshwari18@gmail.com\" style=\"text-decoration: none; color:yellow;\">shobhitmaheshwari18@gmail.com</a></td></tr>  <tr><td>Phone</td><td><a href=\"tel:+919413460572\" style=\"text-decoration: none; color:yellow;\">+91 9413460572</a></td></tr>  <tr><td>LinkedIn</td><td><a href=\"https://www.linkedin.com/in/neonshobhit/\" style=\"text-decoration: none; color:yellow;\">neonshobhit</a></td></tr>  <tr><td>Github</td><td><a href=\"https://github.com/neonshobhit\" style=\"text-decoration: none; color:yellow;\">neonshobhit</a></td></tr></table>"
  },
  "social": {
    "cue": "My social handles",
    "response": "<table><tr><td>Email</td><td><a href=\"mailto:shobhitmaheshwari18@gmail.com\" style=\"text-decoration: none; color:yellow;\">shobhitmaheshwari18@gmail.com</a></td></tr>  <tr><td>Whatsapp</td><td><a href=\"tel:+919413460572\" style=\"text-decoration: none; color:yellow;\">+91 9413460572</a></td></tr>  <tr><td>LinkedIn</td><td><a href=\"https://www.linkedin.com/in/neonshobhit/\" style=\"text-decoration: none; color:yellow;\">neonshobhit</a></td></tr>  <tr><td>Github</td><td><a href=\"https://github.com/neonshobhit\" style=\"text-decoration: none; color:yellow;\">neonshobhit</a></td></tr></table>"
  },
  "resume": {
    "cue": "Get my resume",
    "response": "<a href=\"https://firebasestorage.googleapis.com/v0/b/shobhit-portfolio-terminal.appspot.com/o/shobhit-resume-2024.pdf?alt=media\" style=\"text-decoration: none; color:white;\"><p><u>Click here to download.</u></p></a><br><object data=\"https://firebasestorage.googleapis.com/v0/b/shobhit-portfolio-terminal.appspot.com/o/shobhit-resume-2024.pdf?alt=media\" type=\"application/pdf\" width=\"95%\" height=\"250px\"><br>"
  },
  "": {
    "cue": "",
    "response": ""
  },
  "help": null,
  "man": null
}
